posts/20211201-resources.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Resources</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/org-base.css"/>
<link rel="stylesheet" type="text/css" href="/orgstyle.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=IBM+Plex+Sans:wght@400;500;600;700&display=swap" rel="stylesheet">
<link rel="icon" href="/favicon.ico" type="image/x-icon">
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon">
<link rel="me" href="https://emacs.ch/@dliden">
<link rel="alternate" type="application/rss+xml" title="Daniel Liden's Blog" href="/rss.xml">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="canonical" href="https://danliden.com/posts/20211201-resources.html">
<meta name="author" content="Daniel Liden">
<meta property="og:url" content="https://danliden.com/posts/20211201-resources.html">
<meta property="og:title" content="Resources">
<meta property="og:description" content="Here are some resources to reference for building a simple site with org-mode. I&#39;ve extensively used the sites listed as models for building the present site and expect to continue to reference the...">
<meta property="og:site_name" content="Daniel Liden">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-12-02T00:00:00Z">
<meta property="article:modified_time" content="2026-03-01T19:34:57Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Resources">
<meta name="twitter:description" content="Here are some resources to reference for building a simple site with org-mode. I&#39;ve extensively used the sites listed as models for building the present site and expect to continue to reference the...">
</head>
<body>
<div id="preamble" class="status">
<hr class="topnav-rule">
<header class="site-header">
  <a href="/index.html" class="site-header__brand">
    <h2>Daniel Liden</h2>
  </a>
  <nav class="topnav-links" aria-label="Primary">
    <a href="/archive.html">Blog</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/about.html">About Me</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/photos.html">Photos</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notebooks/">Notebooks</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notes.html">Notes</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a class="topnav-icon" href="/rss.xml" aria-label="RSS feed">
      <svg class="rss-icon" viewBox="0 0 24 24" aria-hidden="true" fill="none" stroke="currentColor" stroke-width="1.8" stroke-linecap="round" stroke-linejoin="round">
        <path d="M5 4h1a14 14 0 0 1 14 14v1"/>
        <path d="M5 11h1a7 7 0 0 1 7 7v1"/>
        <circle cx="6" cy="18" r="2"/>
      </svg>
    </a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <button id="theme-toggle" class="nav-theme-toggle topnav-icon" type="button" aria-label="Switch to dark mode" aria-pressed="false">
      <svg class="theme-icon" viewBox="0 0 24 24" aria-hidden="true" fill="currentColor">
        <path d="M21 12.79A9 9 0 1 1 11.21 3 7 7 0 0 0 21 12.79Z"/>
      </svg>
    </button>
  </nav>
</header>
<hr class="topnav-rule">
</div>
<div id="content" class="content">
<header>
<h1 class="title">Resources</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcaec634">Personal Website in Org</a></li>
<li><a href="#org154590d">OrgCSS Stylesheet</a></li>
<li><a href="#orgec9788b">loomcom</a></li>
<li><a href="#org8619fc4">Blogging using org-mode (and nothing else)</a></li>
<li><a href="#org4db9ac6">Worg Publishing to HTML Tutorial</a></li>
<li><a href="#orgfcb5d1c">My Site</a></li>
</ul>
</div>
</nav>
<div class="PREVIEW" id="org88df3ee">
<p>
Here are some resources to reference for building a simple site with org-mode. I've extensively
used the sites listed as models for building the present site and expect to continue to reference
them for some time.
</p>

</div>


<div id="outline-container-orgcaec634" class="outline-2">
<h2 id="orgcaec634"><a href="https://thibaultmarin.github.io/blog/posts/2016-11-13-Personal_website_in_org.html#html_head">Personal Website in Org</a></h2>
<div class="outline-text-2" id="text-orgcaec634">
<p>
Good resoures for setting up a custom sitemap as an index page.
</p>
</div>
</div>
<div id="outline-container-org154590d" class="outline-2">
<h2 id="org154590d"><a href="https://github.com/gongzhitaao/orgcss">OrgCSS Stylesheet</a></h2>
<div class="outline-text-2" id="text-org154590d">
<p>
Nice-looking basic stylesheet for site. I likely won't stick with this forever but it looks good for
  now.
</p>
</div>
</div>
<div id="outline-container-orgec9788b" class="outline-2">
<h2 id="orgec9788b"><a href="https://loomcom.com/blog/0110_emacs_blogging_for_fun_and_profit.html">loomcom</a></h2>
<div class="outline-text-2" id="text-orgec9788b">
<p>
This site includes a good overview of making list of posts with previews of the first few lines of
text.
</p>
</div>
</div>
<div id="outline-container-org8619fc4" class="outline-2">
<h2 id="org8619fc4"><a href="https://ogbe.net/blog/blogging_with_org.html">Blogging using org-mode (and nothing else)</a></h2>
<div class="outline-text-2" id="text-org8619fc4">
<p>
By Dennis Ogbe. The code I ultimately used for generating and showing previews closely followed that
from this post.
</p>
</div>
</div>
<div id="outline-container-org4db9ac6" class="outline-2">
<h2 id="org4db9ac6"><a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">Worg Publishing to HTML Tutorial</a></h2>
<div class="outline-text-2" id="text-org4db9ac6">
<p>
Good tutorial covering the basics of publishing org-mode projects to html.
</p>
</div>
</div>
<div id="outline-container-orgfcb5d1c" class="outline-2">
<h2 id="orgfcb5d1c"><a href="https://djliden.github.io/">My Site</a></h2>
<div class="outline-text-2" id="text-orgfcb5d1c">
<p>
Here is a link to the site I'm making. Ultimately I will add a custom domain.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-12-02 Thu 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
